# -*- coding: utf-8 -*-


WEEKDAY = {
    '2': u'Понедельник',
    '3': u'Вторник',
    '4': u'Среда',
    '5': u'Четверг',
    '6': u'Пятница',
    '7': u'Суббота',
    '1': u'Воскресенье',
}

TOD = {
    '0': u'Ночью',
    '1': u'Утром',
    '2': u'Днем',
    '3': u'Вечером',
}

MONTH = {
    '1': u'января',
    '2': u'февраля',
    '3': u'марта',
    '4': u'апреля',
    '5': u'мая',
    '6': u'июня',
    '7': u'июля',
    '8': u'августа',
    '9': u'сентября',
    '10': u'октября',
    '11': u'ноября',
    '12': u'декабря',
}

DIRECTION = {
    '0': u'с',
    '1': u'с-з',
    '2': u'з',
    '3': u'ю-з',
    '4': u'ю',
    '5': u'ю-в',
    '6': u'в',
    '7': u'с-в',
}

CLOUDINESS = {
    '0': u'ясно',
    '1': u'малооблачно',
    '2': u'облачно',
    '3': u'пасмурно',
}

PRECIPITATION = {
    '4': u'дождь',
    '5': u'ливень',
    '6': u'снег',
    '7': u'снег',
    '8': u'гроза',
    '9': u'нет данных',
    '10': u'без осадков',
}

PICTURE = {
    '0': u'clear',
    '1': u'clarify',
    '2': u'clarify',
    '3': u'cloudy',
    '4': u'rain',
    '5': u'rain',
    '6': u'snow',
    '7': u'snow',
    '8': u'storm',
    '10': u'clear',
}
